import streamlit as st

st.set_page_config(page_title="손금이란?",page_icon="🖐️")
st.sidebar.header("손금이란?")

st.markdown("### 손금이 상징하는 바는 무엇인가?")
st.markdown("‘손금’은 손의 주인이 지금까지 살아온 길과 나아갈 미래를 예측하는 데 사용됩니다. 각 손금의 의미는 길이, 깊이, 곡률에 따라 달라집니다. 양손의 손금이 동일한 사람은 없기 때문에 모든 요소를 종합적으로 판단해서 해석하는 것이 중요합니다. 각각의 손금이 시작하고 끝나는 지점, 손금이 손의 어느 부위를 지나치는지, 어느 부분에서 교차하는지를 파악하는 것이 중요하다는 것이죠.")

st.markdown("### 감정선")
st.markdown('두뇌선 위를 지나가며 가로선 중 가장 높이 위치한 선이 감정선입니다. 러브 라인으로도 불리는 감정선은 로맨스, 우정, 성생활, 연인에 대한 헌신 등 마음과 관련된 모든 문제를 관장합니다. 감정선을 찾았다면 선이 검지에서 시작하는지 중지에서 시작하는지 살펴봅시다. 감정선이 검지 밑에서 시작한다면 관계에 만족한다는 뜻입니다. 하지만 중지에서 시작한다면 관계에 잡음이 많을 수 있습니다. 선의 깊이는 개인이 대인 관계를 얼마나 중요하게 생각하는지를 보여주는 반면 길이는 관계의 지속 기간을 의미합니다. 즉 감정선이 길수록 좀 더 긴 관계를 유지할 수 있습니다. 감정선이 중간에 끊겨 있다면 다수의 연인이 있을 수 있고 완전히 삶을 송두리째 바꿀 관계를 경험할 수도 있으며 외도의 가능성도 있습니다. 하지만 손금이 끊겼다고 해서 나쁜 행동이 용인되는 것은 아님을 명심하세요!')

st.markdown("### 결혼선")
st.markdown("새끼손가락 아래에 위치한 결혼선은 연애운을 나타냅니다. 결혼선은 보통 한 개에서 두 개의 직선으로 나타나며, 선명할수록 행복한 결혼을 의미합니다. 결혼선이 없는 경우는 자신의 일이나 다른 것들을 우선시하기에 결혼생각에 사로잡혀 있지 않다는 뜻을 의미합니다. 삶의 우선순위가 항상 바뀌듯이 손금도 언제든지 바뀔 수 있습니다. 결혼에 관심이 있음에도 결혼선이 보이지 않는다면 몇 년 후에 다시 확인해 보세요. 달라져 있을 수 있습니다.")

st.markdown('### 생명선')
st.markdown('두뇌선 바로 아래에 위치한 생명선은 경험, 활력, 열정을 의미합니다. 선이 깊을수록 인생을 살면서 풍부한 경험을 할 수 있으며 길이는 타인이 나에게 미치는 영향의 정도를 의미합니다. 생명선이 짧거나 끊어져 있다면 독립심과 주체성이 강하다는 뜻이니 단명할까 걱정할 필요는 없습니다.')

st.markdown('### 운명선')
st.markdown('살면서 우여곡절을 거듭하며 손금 또한 계속해서 변하게 되는데 여러 선 중 가장 빠르게 변하는 선이 운명선입니다. 손바닥 중앙을 세로로 가로지르는 운명선은 개인이 통제할 수 없는 외부적인 요인으로 얼마나 큰 영향을 받는지를 보여줍니다. 직장에서 혹은 일상에서 큰 변화를 경험할 때 잠시 내 손바닥의 운명선을 확인해 보는 건 어떨까요? 운명선이 변했을 수도 있으니까요. 손금술사들은 손이 가려우면 곧 큰 변화가 다가올 수 있다는 신호라고 말합니다. 그러니 이런 사소한 신체적인 변화를 감지할 수 있도록 항상 주의를 기울이는 것이 좋겠습니다.')

st.markdown('### 두뇌선(지능선)')
st.markdown('우리의 정신은 운명을 결정짓는데 중요한 역할을 하죠. 두뇌선을 보면 개인의 지적인 호기심과 관심을 유추할 수 있습니다. 손바닥의 중앙을 가로지르는 두뇌선은 개인이 인생에서 배워야 할 가르침을 보여주기도 합니다. 두뇌선의 깊이는 배움의 깊이를 의미하는 반면 선의 길이는 탐구하고자 하는 분야가 얼마나 많은지를 보여줍니다. 두뇌선이 물결처럼 부드럽게 휘어 있다면 진보적인 생각을 할 확률이 높은 반면 일직선에 가깝다면 좀 더 전통적인 사고방식의 소유자일 수 있습니다. 손금이 끊어져 있는 부분은 정신적인 갈등을 의미합니다. 하지만 돌려 생각하면 인생 최대의 난제를 돌파해서 큰 깨달음을 얻을 순간이 온다는 뜻입니다.')

st.markdown('### 태양선')
st.markdown('‘아폴로 선’으로도 알려진 태양선은 약지에서 가장 가까운 세로선으로 대외적 이미지, 유산, 명예 등을 상징합니다. 태양선의 길이, 깊이, 위치, 운명선과의 거리에 따라서 개인이 어떻게 성공을 할 수 있는지가 달라집니다. 태양선과 운명선이 교차하거나 평행하게 이어진다면 개인의 성공은 자신이 제어할 수 없는 외부적 요인에서 기인할 수 있습니다. 하지만 태양선과 운명선의 거리가 멀다면 개인이 남기는 유산은 외부 요소의 영향을 받지 않을 확률이 높습니다.')
